app/views/semesters/_semester.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = ?  [["semester_id", 1]]
---
    <strong>Sections:</strong>
    <% semester.sections.each do |section| %>