app/views/students/_form.html.erb

SELECT "sections".* FROM "sections"
---
    <%= form.label :section_id %><br>
    <%= form.collection_check_boxes(:section_ids, Section.all, :id, :CRN) %>