app/views/students/_student.html.erb

    <strong>Sections:</strong>
    <% student.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" INNER JOIN "sections_students" ON "sections"."id" = "sections_students"."section_id" WHERE "sections_students"."student_id" = ?  [["student_id", 7]]