app/views/sections/_form.html.erb

    <%= form.label :course_id %>
    <%= form.collection_select :course_id, Course.all, :id, :name %>
---
SELECT "courses".* FROM "courses"

    <%= form.label :semester_id %>
    <%= form.collection_select :semester_id, Semester.all, :id, :semester %>
---
SELECT "semesters".* FROM "semesters"

   <%= form.label :student_id %><br>
   <%= form.collection_check_boxes(:student_ids, Student.all, :id, :Name) %>
---
SELECT "students".* FROM "students"