app/views/sections/_section.html.erb

SELECT "students".* FROM "students" INNER JOIN "sections_students" ON "students"."id" = "sections_students"."student_id" WHERE "sections_students"."section_id" = ?  [["section_id", 2]]
---
    <strong>Students:</strong>
    <% section.students.each do |student| %>