app/views/courses/_form.html.erb

    <%= form.label :prefix_id %>
    <%= form.collection_select :prefix_id, Prefix.all, :id, :prefix %>
---
SELECT "prefixes".* FROM "prefixes"