app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (name like '%computer science 2%')
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("prefix_id", "number", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["prefix_id", 7], ["number", 2050], ["name", "Computer Science 2"], ["created_at", "2022-12-03 10:44:14.372859"], ["updated_at", "2022-12-03 10:44:14.372859"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "prefix_id" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["prefix_id", 10], ["updated_at", "2022-12-05 06:26:09.258920"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)