app/controllers/prefixes_controller.rb

SELECT "prefixes".* FROM "prefixes" WHERE (prefix like '%Eng%')
SELECT "prefixes".* FROM "prefixes"
---
  def index
    if params[:query]
      @prefixes = Prefix.where("prefix like ?", "%#{params[:query]}%")
    else
      @prefixes = Prefix.all

INSERT INTO "prefixes" ("prefix", "created_at", "updated_at") VALUES (?, ?, ?)  [["prefix", "CS"], ["created_at", "2022-12-03 10:43:02.371660"], ["updated_at", "2022-12-03 10:43:02.371660"]]
---
  def create
    @prefix = Prefix.new(prefix_params)

    respond_to do |format|
      if @prefix.save

DELETE FROM "prefixes" WHERE "prefixes"."id" = ?  [["id", 5]]
---
  def destroy
    @prefix.destroy

SELECT "prefixes".* FROM "prefixes" WHERE "prefixes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_prefix
      @prefix = Prefix.find(params[:id])