app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE (CRN like '%6526524%')
SELECT "sections".* FROM "sections"
---
  def index
    if params[:query]
      @sections = Section.where("CRN like ?", "%#{params[:query]}%")
    else
      @sections = Section.all

SELECT "students".* FROM "students"
---
  def new
    @section = Section.new
    @students = Student.all

SELECT "students".* FROM "students"
---
  def edit
    @students = Student.all

INSERT INTO "sections" ("CRN", "course_id", "semester_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["CRN", 5566447], ["course_id", 6], ["semester_id", 1], ["created_at", "2022-12-03 10:44:34.131513"], ["updated_at", "2022-12-03 10:44:34.131513"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 9]]
---
  def destroy
    @section.destroy