app/controllers/semesters_controller.rb

  def index
    @semesters = Semester.all
---
SELECT "semesters".* FROM "semesters"

  def create
    @semester = Semester.new(semester_params)

    respond_to do |format|
      if @semester.save
---
INSERT INTO "semesters" ("semester", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["semester", "Spring"], ["year", 2022], ["created_at", "2022-12-04 05:13:58.832199"], ["updated_at", "2022-12-04 05:13:58.832199"]]