app/controllers/students_controller.rb

  def index
    if params[:query]
      @students = Student.where("Name like ?", "%#{params[:query]}%")
    else
      @students = Student.all
---
SELECT "students".* FROM "students" WHERE (student_number like '%ali%')
SELECT "students".* FROM "students"

  def new
    @student = Student.new
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def edit
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("Name", "Student_number", "Phone_number", "Email_address", "Physical_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "Email_address" = ?, "Physical_address" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["Email_address", "ataha2@msudenver.edu"], ["Physical_address", "17178 E Tennessee Dr"], ["updated_at", "2022-12-05 06:34:33.895204"], ["id", 14]]